app/views/posts/_form.html.erb

    </td><td class="controls">
    <%=f.select :district_id, options_from_collection_for_select(District.order('name ASC'), 'id', 'name', @post.district_id), :include_blank => true, :class => 'text_field' %>
---
SELECT "districts".* FROM "districts" ORDER BY name ASC